In [15]:
%reload_ext sql

In [21]:
%sql ibm_db_sa://wsw52499:zhtsxg8%2Bk0v9l6jk@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB

In [22]:
%sql select* from student

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
Done.

[('Bhaskar', 'Bhandari', 'bharatbhandari23@gmail.com', 'ktm'),
 ('kd', 'Bhandari', 'bharatbhandari5123@gmail.com', 'ktm'),
 ('Bhawana', 'Bhandari', 'bharatbhandari5123@gmail.com', 'ktm')]

In [33]:
%sql drop table Student

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: Exception('Statement Execute Failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0204N  "WSW52499.STUDENT" is an undefined name.  SQLSTATE=42704\r SQLCODE=-204')
[SQL: drop table Student]
(Background on this error at: http://sqlalche.me/e/f405)

In [35]:
%sql create table Student(SN VARCHAR(5)  ,first_name VARCHAR(20),middle_name VARCHAR(20),last_name VARCHAR(20),Symbol_number VARCHAR(20))

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
Done.

[]

In [39]:
%sql insert into student(sn,first_name,middle_name,last_name,Symbol_number)values('1','bharat','bahadur','bhandari','70500044'),('2','bharat','bahadur','bhandari','70500044'),('3','bharat','bahadur','bhandari','70500044'),('4','bharat','bahadur','bhandari','70500044'),('5','bharat','bahadur','bhandari','70500044'),('6','bharat','bahadur','bhandari','70500044')

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
6 rows affected.

[]

In [40]:
%sql select *from Student

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
Done.

[('1', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('2', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('3', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('4', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('5', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('6', 'bharat', 'bahadur', 'bhandari', '70500044')]

In [53]:
%sql update Student set first_name='Gita' where SN = '2'

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
1 rows affected.

[]

In [54]:
%sql select *from student

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
Done.

[('1', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('2', 'Gita', 'bahadur', 'bhandari', '70500044'),
 ('3', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('4', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('5', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('6', 'bharat', 'bahadur', 'bhandari', '70500044')]

In [55]:
%sql select DISTINCT(first_name) from student

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
Done.

[('Gita',), ('bharat',)]

In [58]:
%sql delete  from student where SN='6'

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
1 rows affected.

[]

In [59]:
%sql select count(*)from student

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('5'),)]

In [60]:
%sql select *from student

 * ibm_db_sa://wsw52499:***@dashdb-txn-sbox-yp-dal09-11.services.dal.bluemix.net:50000/BLUDB
Done.

[('1', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('2', 'Gita', 'bahadur', 'bhandari', '70500044'),
 ('3', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('4', 'bharat', 'bahadur', 'bhandari', '70500044'),
 ('5', 'bharat', 'bahadur', 'bhandari', '70500044')]